---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.DifferentEntityTypes
source: html/1202ad11-8794-1d55-f063-c42e56caec57.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.DifferentEntityTypes Property

Can't auto-detect boundary. The layers selected contain data that may make the Toposurface look incorrect. For better results, try selecting only those layers that contain relevant 3D info.

## Syntax (C#)
```csharp
public static FailureDefinitionId DifferentEntityTypes { get; }
```